In [1]:
import pandas as pd
df = pd.read_csv(r'D:\Machine leaning my work\Naive Bayes\titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target=df.Survived 
inputs=df.drop('Survived',axis='columns')

In [4]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [5]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [6]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [7]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [8]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1

In [12]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size=0.2)

In [13]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [15]:
model.fit(X_train,y_train)

GaussianNB()

In [16]:
model.score(X_test,y_test)

0.7988826815642458

In [18]:
X_test[:10]

     Pclass        Age      Fare  female  male
549       2   8.000000   36.7500       0     1
581       1  39.000000  110.8833       1     0
497       3  29.699118   15.1000       0     1
611       3  29.699118    7.0500       0     1
794       3  25.000000    7.8958       0     1
713       3  29.000000    9.4833       0     1
637       2  31.000000   26.2500       0     1
506       2  33.000000   26.0000       1     0
180       3  29.699118   69.5500       1     0
329       1  16.000000   57.9792       1     0

In [19]:
y_test[:10]

549    1
581    1
497    0
611    0
794    0
713    0
637    0
506    1
180    0
329    1
Name: Survived, dtype: int64

In [20]:
model.predict(X_test[:10])

array([0, 1, 0, 0, 0, 0, 0, 1, 1, 1], dtype=int64)

In [23]:
model.predict_proba(X_test[:10]) # predicting probabilities

array([[9.60767706e-01, 3.92322936e-02],
       [1.62034743e-04, 9.99837965e-01],
       [9.90005686e-01, 9.99431422e-03],
       [9.89723350e-01, 1.02766499e-02],
       [9.89361882e-01, 1.06381176e-02],
       [9.89829207e-01, 1.01707934e-02],
       [9.77420134e-01, 2.25798663e-02],
       [4.04443718e-02, 9.59555628e-01],
       [2.27793978e-02, 9.77220602e-01],
       [4.25061338e-03, 9.95749387e-01]])